In [1]:
import sqlalchemy

In [3]:
import pymysql
pymysql.install_as_MySQLdb()

In [4]:
sqlalchemy.create_engine('mysql://root:root@localhost/Employee_Management')

Engine(mysql://root:***@localhost/Employee_Management)

In [5]:
%load_ext sql

In [6]:
%sql mysql://root:root@localhost/Employee_Management

In [7]:
%%sql
show databases;

 * mysql://root:***@localhost/Employee_Management
15 rows affected.

[('Animals',),
 ('Bank',),
 ('Employee_Management',),
 ('IIITMK',),
 ('Notetest',),
 ('Student',),
 ('The_Computer_Store',),
 ('fkdemo',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('student_2020',),
 ('student_2020_feb06',),
 ('sys',),
 ('test',)]

In [8]:
%%sql
use Employee_Management;

 * mysql://root:***@localhost/Employee_Management
0 rows affected.

[]

In [10]:
%%sql
show tables;

 * mysql://root:***@localhost/Employee_Management
0 rows affected.

[]

In [11]:
%%sql
CREATE TABLE Departments (
  Code INTEGER PRIMARY KEY,
  Name varchar(255) NOT NULL ,
  Budget decimal NOT NULL 
);

 * mysql://root:***@localhost/Employee_Management
0 rows affected.

[]

In [12]:
%%sql
CREATE TABLE Employees (
  SSN INTEGER PRIMARY KEY,
  Name varchar(255) NOT NULL ,
  LastName varchar(255) NOT NULL ,
  Department INTEGER NOT NULL , 
  foreign key (department) references Departments(Code) 
);

 * mysql://root:***@localhost/Employee_Management
0 rows affected.

[]

In [13]:
%%sql
show tables

 * mysql://root:***@localhost/Employee_Management
2 rows affected.

[('Departments',), ('Employees',)]

In [15]:
%%sql
Desc Employees;

 * mysql://root:***@localhost/Employee_Management
4 rows affected.

[('SSN', 'int', 'NO', 'PRI', None, ''),
 ('Name', 'varchar(255)', 'NO', '', None, ''),
 ('LastName', 'varchar(255)', 'NO', '', None, ''),
 ('Department', 'int', 'NO', 'MUL', None, '')]

In [16]:
%%sql
INSERT INTO Departments(Code,Name,Budget) VALUES(14,'IT',65000);
INSERT INTO Departments(Code,Name,Budget) VALUES(37,'Accounting',15000);
INSERT INTO Departments(Code,Name,Budget) VALUES(59,'Human Resources',240000);
INSERT INTO Departments(Code,Name,Budget) VALUES(77,'Research',55000);

INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('123234877','Michael','Rogers',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('152934485','Anand','Manikutty',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('222364883','Carol','Smith',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('326587417','Joe','Stevens',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332154719','Mary-Anne','Foster',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332569843','George','ODonnell',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('546523478','John','Doe',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('631231482','David','Smith',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('654873219','Zacary','Efron',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('745685214','Eric','Goldsmith',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657245','Elizabeth','Doe',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657246','Kumar','Swamy',14);

 * mysql://root:***@localhost/Employee_Management
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [17]:
%%sql
select * from Employees;
select * from Departments;

 * mysql://root:***@localhost/Employee_Management
12 rows affected.
4 rows affected.

[(14, 'IT', Decimal('65000')),
 (37, 'Accounting', Decimal('15000')),
 (59, 'Human Resources', Decimal('240000')),
 (77, 'Research', Decimal('55000'))]

In [18]:
%%sql
select LastName from Employees;

 * mysql://root:***@localhost/Employee_Management
12 rows affected.

[('Rogers',),
 ('Manikutty',),
 ('Smith',),
 ('Stevens',),
 ('Foster',),
 ('ODonnell',),
 ('Doe',),
 ('Smith',),
 ('Efron',),
 ('Goldsmith',),
 ('Doe',),
 ('Swamy',)]

In [20]:
%%sql
select distinct LastName from Employees;

 * mysql://root:***@localhost/Employee_Management
10 rows affected.

[('Rogers',),
 ('Manikutty',),
 ('Smith',),
 ('Stevens',),
 ('Foster',),
 ('ODonnell',),
 ('Doe',),
 ('Efron',),
 ('Goldsmith',),
 ('Swamy',)]

In [21]:
%%sql
select * from Employees where lastname = 'Smith';

 * mysql://root:***@localhost/Employee_Management
2 rows affected.

[(222364883, 'Carol', 'Smith', 37), (631231482, 'David', 'Smith', 77)]

In [27]:
%%sql
select * from Employees where lastname in ('Smith', 'Doe');

 * mysql://root:***@localhost/Employee_Management
4 rows affected.

[(222364883, 'Carol', 'Smith', 37),
 (546523478, 'John', 'Doe', 59),
 (631231482, 'David', 'Smith', 77),
 (845657245, 'Elizabeth', 'Doe', 14)]

In [29]:
%%sql
select * from Employees where LastName like 'S%';

 * mysql://root:***@localhost/Employee_Management
4 rows affected.

[(222364883, 'Carol', 'Smith', 37),
 (326587417, 'Joe', 'Stevens', 37),
 (631231482, 'David', 'Smith', 77),
 (845657246, 'Kumar', 'Swamy', 14)]

In [30]:
%%sql
select sum(budget) from Departments;

 * mysql://root:***@localhost/Employee_Management
1 rows affected.

[(Decimal('375000'),)]

In [31]:
%%sql
select Name, sum(Budget) from Departments group by Name;

 * mysql://root:***@localhost/Employee_Management
4 rows affected.

[('IT', Decimal('65000')),
 ('Accounting', Decimal('15000')),
 ('Human Resources', Decimal('240000')),
 ('Research', Decimal('55000'))]

In [34]:
%%sql
select Department, count(*) as No_of_Employee from Employees group by department;

 * mysql://root:***@localhost/Employee_Management
4 rows affected.

[(14, 5), (37, 2), (59, 3), (77, 2)]

In [37]:
%%sql
select a.*, b.* from Employees a join Departments b on a.Department = b.code;

 * mysql://root:***@localhost/Employee_Management
12 rows affected.

[(123234877, 'Michael', 'Rogers', 14, 14, 'IT', Decimal('65000')),
 (152934485, 'Anand', 'Manikutty', 14, 14, 'IT', Decimal('65000')),
 (332154719, 'Mary-Anne', 'Foster', 14, 14, 'IT', Decimal('65000')),
 (845657245, 'Elizabeth', 'Doe', 14, 14, 'IT', Decimal('65000')),
 (845657246, 'Kumar', 'Swamy', 14, 14, 'IT', Decimal('65000')),
 (222364883, 'Carol', 'Smith', 37, 37, 'Accounting', Decimal('15000')),
 (326587417, 'Joe', 'Stevens', 37, 37, 'Accounting', Decimal('15000')),
 (546523478, 'John', 'Doe', 59, 59, 'Human Resources', Decimal('240000')),
 (654873219, 'Zacary', 'Efron', 59, 59, 'Human Resources', Decimal('240000')),
 (745685214, 'Eric', 'Goldsmith', 59, 59, 'Human Resources', Decimal('240000')),
 (332569843, 'George', 'ODonnell', 77, 77, 'Research', Decimal('55000')),
 (631231482, 'David', 'Smith', 77, 77, 'Research', Decimal('55000'))]

In [38]:
%%sql

SELECT SSN, E.Name AS Name_E, LastName, D.Name AS Name_D, Department, Code, Budget
 FROM Employees E INNER JOIN Departments D
 ON E.Department = D.Code;

 * mysql://root:***@localhost/Employee_Management
12 rows affected.

[(123234877, 'Michael', 'Rogers', 'IT', 14, 14, Decimal('65000')),
 (152934485, 'Anand', 'Manikutty', 'IT', 14, 14, Decimal('65000')),
 (332154719, 'Mary-Anne', 'Foster', 'IT', 14, 14, Decimal('65000')),
 (845657245, 'Elizabeth', 'Doe', 'IT', 14, 14, Decimal('65000')),
 (845657246, 'Kumar', 'Swamy', 'IT', 14, 14, Decimal('65000')),
 (222364883, 'Carol', 'Smith', 'Accounting', 37, 37, Decimal('15000')),
 (326587417, 'Joe', 'Stevens', 'Accounting', 37, 37, Decimal('15000')),
 (546523478, 'John', 'Doe', 'Human Resources', 59, 59, Decimal('240000')),
 (654873219, 'Zacary', 'Efron', 'Human Resources', 59, 59, Decimal('240000')),
 (745685214, 'Eric', 'Goldsmith', 'Human Resources', 59, 59, Decimal('240000')),
 (332569843, 'George', 'ODonnell', 'Research', 77, 77, Decimal('55000')),
 (631231482, 'David', 'Smith', 'Research', 77, 77, Decimal('55000'))]

In [42]:
%%sql
select a.name, a.lastname, b.name Department_name, b.Budget
from Employees a join Departments b
on a.department = b.code;

 * mysql://root:***@localhost/Employee_Management
12 rows affected.

[('Michael', 'Rogers', 'IT', Decimal('65000')),
 ('Anand', 'Manikutty', 'IT', Decimal('65000')),
 ('Mary-Anne', 'Foster', 'IT', Decimal('65000')),
 ('Elizabeth', 'Doe', 'IT', Decimal('65000')),
 ('Kumar', 'Swamy', 'IT', Decimal('65000')),
 ('Carol', 'Smith', 'Accounting', Decimal('15000')),
 ('Joe', 'Stevens', 'Accounting', Decimal('15000')),
 ('John', 'Doe', 'Human Resources', Decimal('240000')),
 ('Zacary', 'Efron', 'Human Resources', Decimal('240000')),
 ('Eric', 'Goldsmith', 'Human Resources', Decimal('240000')),
 ('George', 'ODonnell', 'Research', Decimal('55000')),
 ('David', 'Smith', 'Research', Decimal('55000'))]

In [43]:
%%sql
/* Without labels */
SELECT Employees.Name, LastName, Departments.Name AS DepartmentsName, Budget
  FROM Employees INNER JOIN Departments
  ON Employees.Department = Departments.Code;

 * mysql://root:***@localhost/Employee_Management
12 rows affected.

[('Michael', 'Rogers', 'IT', Decimal('65000')),
 ('Anand', 'Manikutty', 'IT', Decimal('65000')),
 ('Mary-Anne', 'Foster', 'IT', Decimal('65000')),
 ('Elizabeth', 'Doe', 'IT', Decimal('65000')),
 ('Kumar', 'Swamy', 'IT', Decimal('65000')),
 ('Carol', 'Smith', 'Accounting', Decimal('15000')),
 ('Joe', 'Stevens', 'Accounting', Decimal('15000')),
 ('John', 'Doe', 'Human Resources', Decimal('240000')),
 ('Zacary', 'Efron', 'Human Resources', Decimal('240000')),
 ('Eric', 'Goldsmith', 'Human Resources', Decimal('240000')),
 ('George', 'ODonnell', 'Research', Decimal('55000')),
 ('David', 'Smith', 'Research', Decimal('55000'))]

In [46]:
%%sql
Desc Employees;

 * mysql://root:***@localhost/Employee_Management
4 rows affected.

[('SSN', 'int', 'NO', 'PRI', None, ''),
 ('Name', 'varchar(255)', 'NO', '', None, ''),
 ('LastName', 'varchar(255)', 'NO', '', None, ''),
 ('Department', 'int', 'NO', 'MUL', None, '')]

In [47]:
%%sql
select name, lastname
from Employees 
where department in (
select code from Departments where Budget>60000
);

 * mysql://root:***@localhost/Employee_Management
8 rows affected.

[('Michael', 'Rogers'),
 ('Anand', 'Manikutty'),
 ('Mary-Anne', 'Foster'),
 ('Elizabeth', 'Doe'),
 ('Kumar', 'Swamy'),
 ('John', 'Doe'),
 ('Zacary', 'Efron'),
 ('Eric', 'Goldsmith')]

In [50]:
%%sql
-- 2.13 Select the departments with a budget larger than the average budget of all the departments.
select *
from Departments 
where budget > (
select avg(budget) from Departments
);

 * mysql://root:***@localhost/Employee_Management
1 rows affected.

[(59, 'Human Resources', Decimal('240000'))]

In [51]:
%%sql
-- Select the names of departments with more than two employees.
select b.name 
from Departments b
where code in (
select department
from Employees
group by department
having count(*)>2
);

 * mysql://root:***@localhost/Employee_Management
2 rows affected.

[('IT',), ('Human Resources',)]

In [52]:
%%sql
-- Select the name and last name of Employees working for Departments with second lowest budget.

select name, lastname
from Employees
where department =(
select temp.code 
from (select * from Departments order by budget limit 2) temp
order by temp.budget desc limit 1
);

 * mysql://root:***@localhost/Employee_Management
2 rows affected.

[('George', 'ODonnell'), ('David', 'Smith')]

In [54]:
%%sql
-- Reduce the budget of all Departments by 10%.
update Departments 
set budget = 0.9 * budget;

 * mysql://root:***@localhost/Employee_Management
4 rows affected.

[]

In [56]:
%%sql
-- Reassign all employees from the Research department (code 77) to the IT department (code 14).
update Employees
set department = 14
where department = 77;

 * mysql://root:***@localhost/Employee_Management
0 rows affected.

[]

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql